Hi, @linouk23! That worked! I needed to upgrade the Terraform's version to 0.15.5: 

``` bash
Terraform v0.15.5
on linux_amd64
+ provider registry.terraform.io/confluentinc/confluentcloud v0.5.0
+ provider registry.terraform.io/hashicorp/vault v3.2.1
```

TF-Plan:
``` bash
Terraform will perform the following actions:

  # confluentcloud_kafka_cluster.this will be created
  + resource "confluentcloud_kafka_cluster" "this" {
      + api_version        = (known after apply)
      + availability       = "MULTI_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "<cloud>"
      + display_name       = "test_cluster"
      + http_endpoint      = (known after apply)
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "<region>"

      + basic {}

      + environment {
          + id = "env-12345"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Before, I was running with terraform 0.14.8.

Thanks again! :)
